demo-confs/tsung/http_simple.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/share/tsung/tsung-1.0.dtd">
<tsung loglevel="notice" version="1.0">

  <!-- Client side setup -->
  <clients>
    <client host="localhost" use_controller_vm="true"/>
  </clients>

  <!-- Server side setup -->
<servers>
  <server host="nginx" port="80" type="tcp"></server>
</servers>

  <load>
  <!-- several arrival phases can be set: for each phase, you can set
  the mean inter-arrival time between new clients and the phase
  duration -->
   <arrivalphase phase="1" duration="60" unit="minute">
     <users interarrival="0.1" unit="second"></users>
   </arrivalphase>
  </load>

  <options>
   <option type="ts_http" name="user_agent">
    <user_agent probability="80">Mozilla/5.0 (X11; U; Linux i686; en-US; rv:1.7.8) Gecko/20050513 Galeon/1.3.21</user_agent>
    <user_agent probability="20">Mozilla/5.0 (Windows; U; Windows NT 5.2; fr-FR; rv:1.7.8) Gecko/20050511 Firefox/1.0.4</user_agent>
   </option>
  </options>

  <!-- start a session for a http user. the probability is the
  frequency of this type os session. The sum of all session's
  probabilities must be 100 -->

 <sessions>
  <session name="http-example" probability="100" type="ts_http">

    <request> <http url="/301" method="GET" version="1.1"></http> </request>

    <thinktime value="10" random="true"></thinktime>

    <request> <http url="/302" method="GET" version="1.1"></http> </request>

    <thinktime value="10" random="true"></thinktime>

    <request> <http url="/403" method="GET" version="1.1"></http> </request>

    <thinktime value="10" random="true"></thinktime>

    <request> <http url="/404" method="GET" version="1.1"></http> </request>

    <thinktime value="10" random="true"></thinktime>

    <request> <http url="/500" method="GET" version="1.1"></http> </request>

    <thinktime value="10" random="true"></thinktime>

    <request> <http url="/501" method="GET" version="1.1"></http> </request>

    <thinktime value="10" random="true"></thinktime>

    <request> <http url="/" method="GET" version="1.1" ></http> </request>

  </session>
 </sessions>
</tsung>